TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_dac12.h
/* DAC12_CTL1 Bits */
/* DAC12_CTL1[AMPEN] Bits */
#define DAC12_CTL1_AMPEN_OFS                     (0)                             /* !< AMPEN Offset */
#define DAC12_CTL1_AMPEN_MASK                    ((uint32_t)0x00000001U)         /* !< AMP_EN - output amplifier enabled
                                                                                    or disabled 0 : disabled  1 : enabled */
#define DAC12_CTL1_AMPEN_DISABLE                 ((uint32_t)0x00000000U)         /* !< disable */
#define DAC12_CTL1_AMPEN_ENABLE                  ((uint32_t)0x00000001U)         /* !< enable */
/* DAC12_CTL1[REFSP] Bits */
#define DAC12_CTL1_REFSP_OFS                     (8)                             /* !< REFSP Offset */
#define DAC12_CTL1_REFSP_MASK                    ((uint32_t)0x00000100U)         /* !< This bit selects the DAC voltage
                                                                                    reference source + input. */
#define DAC12_CTL1_REFSP_VDDA                    ((uint32_t)0x00000000U)         /* !< Analog supply (VDDA) as VR+ */
#define DAC12_CTL1_REFSP_VEREFP                  ((uint32_t)0x00000100U)         /* !< VEREFP pin as VR+ */
/* DAC12_CTL1[OPS] Bits */
#define DAC12_CTL1_OPS_OFS                       (24)                            /* !< OPS Offset */
#define DAC12_CTL1_OPS_MASK                      ((uint32_t)0x01000000U)         /* !< These bits select the DAC output on
                                                                                    device pin. */
#define DAC12_CTL1_OPS_NOC0                      ((uint32_t)0x00000000U)         /* !< No connect. Both DAC output
                                                                                    switches are open. */
#define DAC12_CTL1_OPS_OUT0                      ((uint32_t)0x01000000U)         /* !< OUT0 output is selected */
/* DAC12_CTL1[REFSN] Bits */
#define DAC12_CTL1_REFSN_OFS                     (9)                             /* !< REFSN Offset */
#define DAC12_CTL1_REFSN_MASK                    ((uint32_t)0x00000200U)         /* !< This bit selects the DAC voltage
                                                                                    reference source + input. */
#define DAC12_CTL1_REFSN_VEREFN                  ((uint32_t)0x00000000U)         /* !< VEREFN pin as VR- */
#define DAC12_CTL1_REFSN_VSSA                    ((uint32_t)0x00000200U)         /* !< Analog supply (VSSA) as VR- */
/* DAC12_CTL1[AMPHIZ] Bits */
#define DAC12_CTL1_AMPHIZ_OFS                    (1)                             /* !< AMPHIZ Offset */
#define DAC12_CTL1_AMPHIZ_MASK                   ((uint32_t)0x00000002U)         /* !< AMPHIZ - amplifier output value  0
                                                                                    : amplifier output is high impedance
                                                                                    1 : amplifier output is pulled down
                                                                                    to ground */
#define DAC12_CTL1_AMPHIZ_HIZ                    ((uint32_t)0x00000000U)         /* !< HiZ when disable */
#define DAC12_CTL1_AMPHIZ_PULLDOWN               ((uint32_t)0x00000002U)         /* !< dacout pulldown when disable */

/* DAC12_CTL2 Bits */
/* DAC12_CTL2[FIFOEN] Bits */
#define DAC12_CTL2_FIFOEN_OFS                    (0)                             /* !< FIFOEN Offset */
#define DAC12_CTL2_FIFOEN_MASK                   ((uint32_t)0x00000001U)         /* !< This bit enables the FIFO and the
                                                                                    FIFO hardware control state machine. */
#define DAC12_CTL2_FIFOEN_CLR                    ((uint32_t)0x00000000U)         /* !< FIFO is disabled */
#define DAC12_CTL2_FIFOEN_SET                    ((uint32_t)0x00000001U)         /* !< FIFO is enabled */
/* DAC12_CTL2[FIFOTH] Bits */
#define DAC12_CTL2_FIFOTH_OFS                    (8)                             /* !< FIFOTH Offset */
#define DAC12_CTL2_FIFOTH_MASK                   ((uint32_t)0x00000300U)         /* !< These bits determine the FIFO
                                                                                    threshold. In case of DMA based
                                                                                    operation, DAC generates new DMA
                                                                                    trigger when the number of empty
                                                                                    locations in FIFO match the selected
                                                                                    FIFO threshold level.  In case of CPU
                                                                                    based operation, the FIFO threshold
                                                                                    bits are don't care and FIFO level is
                                                                                    directly indicated through the
                                                                                    respective bits in the RIS register. */
#define DAC12_CTL2_FIFOTH_LOW                    ((uint32_t)0x00000000U)         /* !< One fourth of the FIFO locations
                                                                                    are empty */
#define DAC12_CTL2_FIFOTH_MED                    ((uint32_t)0x00000100U)         /* !< Half of the FIFO locations are
                                                                                    empty */
#define DAC12_CTL2_FIFOTH_HIGH                   ((uint32_t)0x00000200U)         /* !< Three fourth of the FIFO locations
                                                                                    are empty */
#define DAC12_CTL2_FIFOTH_SPARE                  ((uint32_t)0x00000300U)         /* !< Reserved value. Defaults to same
                                                                                    effect as FIFOTH = 0 (One fourth of
                                                                                    the FIFO locations are empty). */
/* DAC12_CTL2[FIFOTRIGSEL] Bits */
#define DAC12_CTL2_FIFOTRIGSEL_OFS               (16)                            /* !< FIFOTRIGSEL Offset */
#define DAC12_CTL2_FIFOTRIGSEL_MASK              ((uint32_t)0x00030000U)         /* !< These bits select the source for
                                                                                    FIFO read trigger. When the selected
                                                                                    FIFO read trigger is asserted, the
                                                                                    data from FIFO (as indicated by read
                                                                                    pointer) is moved into internal DAC
                                                                                    data register. */
#define DAC12_CTL2_FIFOTRIGSEL_STIM              ((uint32_t)0x00000000U)         /* !< Sample time generator output */
#define DAC12_CTL2_FIFOTRIGSEL_TRIG0             ((uint32_t)0x00010000U)         /* !< Hardware trigger-0 from event
                                                                                    fabric */
#define DAC12_CTL2_FIFOTRIGSEL_SPARE1            ((uint32_t)0x00020000U)         /* !< Reserved - unimplemented */
#define DAC12_CTL2_FIFOTRIGSEL_SPARE2            ((uint32_t)0x00030000U)         /* !< Reserved - unimplemented */
/* DAC12_CTL2[DMATRIGEN] Bits */
#define DAC12_CTL2_DMATRIGEN_OFS                 (24)                            /* !< DMATRIGEN Offset */
#define DAC12_CTL2_DMATRIGEN_MASK                ((uint32_t)0x01000000U)         /* !< This bit enables the DMA trigger
                                                                                    generation mechanism. When this bit
                                                                                    is set along with FIFOEN, the DMA
                                                                                    trigger is generated based on the
                                                                                    empty FIFO locations qualified by
                                                                                    FIFOTH settings. This bit should be
                                                                                    cleared by software to stop further
                                                                                    DMA triggers. */
#define DAC12_CTL2_DMATRIGEN_CLR                 ((uint32_t)0x00000000U)         /* !< DMA trigger generation mechanism is
                                                                                    disabled */
#define DAC12_CTL2_DMATRIGEN_SET                 ((uint32_t)0x01000000U)         /* !< DMA trigger generation mechanism is
                                                                                    enabled */

/* DAC12_CTL3 Bits */
/* DAC12_CTL3[STIMEN] Bits */
#define DAC12_CTL3_STIMEN_OFS                    (0)                             /* !< STIMEN Offset */
#define DAC12_CTL3_STIMEN_MASK                   ((uint32_t)0x00000001U)         /* !< This bit enables the sample time
                                                                                    generator. */
#define DAC12_CTL3_STIMEN_CLR                    ((uint32_t)0x00000000U)         /* !< Sample time generator is disabled */
#define DAC12_CTL3_STIMEN_SET                    ((uint32_t)0x00000001U)         /* !< Sample time generator is enabled */
/* DAC12_CTL3[STIMCONFIG] Bits */
#define DAC12_CTL3_STIMCONFIG_OFS                (8)                             /* !< STIMCONFIG Offset */
#define DAC12_CTL3_STIMCONFIG_MASK               ((uint32_t)0x00000F00U)         /* !< These bits are used to configure
                                                                                    the trigger rate from the sample time
                                                                                    generator. The STIMCONFIG values 10
                                                                                    to 15 are reserved and default to
                                                                                    same effect as value 0 (500SPS). */
#define DAC12_CTL3_STIMCONFIG__500SPS            ((uint32_t)0x00000000U)         /* !< Trigger rate is 500 sps (clock
                                                                                    divide value is 4000) */
#define DAC12_CTL3_STIMCONFIG__1KSPS             ((uint32_t)0x00000100U)         /* !< Trigger rate is 1 ksps (clock
                                                                                    divide value is 2000) */
#define DAC12_CTL3_STIMCONFIG__2KSPS             ((uint32_t)0x00000200U)         /* !< Trigger rate is 2 ksps (clock
                                                                                    divide value is 1000) */
#define DAC12_CTL3_STIMCONFIG__4KSPS             ((uint32_t)0x00000300U)         /* !< Trigger rate is 4 ksps (clock
                                                                                    divide value is 500) */
#define DAC12_CTL3_STIMCONFIG__8KSPS             ((uint32_t)0x00000400U)         /* !< Trigger rate is 8 ksps (clock
                                                                                    divide value is 250) */
#define DAC12_CTL3_STIMCONFIG__16KSPS            ((uint32_t)0x00000500U)         /* !< Trigger rate is 16 ksps (clock
                                                                                    divide value is 125) */
#define DAC12_CTL3_STIMCONFIG__100KSPS           ((uint32_t)0x00000600U)         /* !< Trigger rate is 100 ksps (clock
                                                                                    divide value is 20) */
#define DAC12_CTL3_STIMCONFIG__200KSPS           ((uint32_t)0x00000700U)         /* !< Trigger rate is 200 ksps (clock
                                                                                    divide value is 10) */
#define DAC12_CTL3_STIMCONFIG__500KSPS           ((uint32_t)0x00000800U)         /* !< Trigger rate is 500 ksps (clock
                                                                                    divide value is 4) */
#define DAC12_CTL3_STIMCONFIG__1MSPS             ((uint32_t)0x00000900U)         /* !< Trigger rate is 1 Msps (clock
                                                                                    divide value is 2) */

/* DAC12_CALCTL Bits */
/* DAC12_CALCTL[CALON] Bits */
#define DAC12_CALCTL_CALON_OFS                   (0)                             /* !< CALON Offset */
#define DAC12_CALCTL_CALON_MASK                  ((uint32_t)0x00000001U)         /* !< This bit when set initiates the DAC
                                                                                    offset error calibration sequence and
                                                                                    is automatically reset when the
                                                                                    offset error calibration completes. */
#define DAC12_CALCTL_CALON_INACTIVE              ((uint32_t)0x00000000U)         /* !< Offset error calibration is not
                                                                                    active */
#define DAC12_CALCTL_CALON_ACTIVE                ((uint32_t)0x00000001U)         /* !< Initiate offset error calibration
                                                                                    or offset error calibration is
                                                                                    already in progress */
/* DAC12_CALCTL[CALSEL] Bits */
#define DAC12_CALCTL_CALSEL_OFS                  (1)                             /* !< CALSEL Offset */
#define DAC12_CALCTL_CALSEL_MASK                 ((uint32_t)0x00000002U)         /* !< This bit is used to select between
                                                                                    factory trim or self calibration
                                                                                    trim. */
#define DAC12_CALCTL_CALSEL_FACTORYTRIM          ((uint32_t)0x00000000U)         /* !< Factory Trim Calibration Values are
                                                                                    used when calibration is enabled */
#define DAC12_CALCTL_CALSEL_SELFCALIBRATIONTRIM  ((uint32_t)0x00000002U)         /* !< Self Calibration Trim Values are
                                                                                    used when calibration is enabled */

/* DAC12_CALDATA Bits */
/* DAC12_CALDATA[DATA] Bits */
#define DAC12_CALDATA_DATA_OFS                   (0)                             /* !< DATA Offset */
#define DAC12_CALDATA_DATA_MASK                  ((uint32_t)0x0000007FU)         /* !< DAC offset error calibration data.
                                                                                    The DAC offset error calibration data
                                                                                    is represented in twos complement
                                                                                    format providing a range of 64 to
                                                                                    +63. This is read-only bit,
                                                                                    reflecting the calibration data.
                                                                                    Writing to this register will have no
                                                                                    effect, it will not change the
                                                                                    calibration value. */

/* DAC12_DATA0 Bits */
/* DAC12_DATA0[DATA_VALUE] Bits */
#define DAC12_DATA0_DATA_VALUE_OFS               (0)                             /* !< DATA_VALUE Offset */
#define DAC12_DATA0_DATA_VALUE_MASK              ((uint32_t)0x00000FFFU)         /* !< This is the data written for
                                                                                    digital to analog conversion. */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_dac12__include */
